@echo off
@REM shift /n 表示将第n个参数移除
echo   %0 %1 %2 %3 %4 %5 %6 %7 %8 %9
pause
shift /0   
echo   %0 %1 %2 %3 %4 %5 %6 %7 %8 %9
pause
shift /1   
echo   %0 %1 %2 %3 %4 %5 %6 %7 %8 %9
shift /2   
echo   %0 %1 %2 %3 %4 %5 %6 %7 %8 %9
shift /3   
echo   %0 %1 %2 %3 %4 %5 %6 %7 %8 %9
shift /4   
echo   %1 %2 %3 %4 %5 %6 %7 %8 %9
shift /5   
echo   %1 %2 %3 %4 %5 %6 %7 %8 %9
shift /6   
echo   %1 %2 %3 %4 %5 %6 %7 %8 %9
shift /7   
echo   %1 %2 %3 %4 %5 %6 %7 %8 %9
shift /8   
echo   %1 %2 %3 %4 %5 %6 %7 %8 %9
pause

@REM （1）如果不借助其他其他命令，批处理做多接收9个额外的参数（%1~%9）。

@REM （2）使用shift命令可以对参数进行偏移，从而取到更多的参数。

@REM （3）如果使用的某个参数没有传递进来，则该变量为空。